"""
    printf 风格的字符串格式化
"""
s1 = "字符串具有一种特殊的内置操作：%s" % "语言"
# print(s1)
# 字符串具有一种特殊的内置操作：语言

s2 = "字符串具有一种特殊的内置操作：%s%s" % ("python", "语言")
# print(s2)
# 字符串具有一种特殊的内置操作：python语言

s3 = '%(language)s has %(number)03d quote types.' % {"number": 2, 'language': "Python"}
# print(s3)
# Python has 002 quote types.

s4 = "%#o; %o; %s; %r; %a" % (12, 12, "执行", "执行", "执行")
# print(s4)
# 0o14; 14; 执行; '执行'; '\u6267\u884c'

s5 = "%-6d::%06d::%0-6d::% -6d::%-+6d::" % (12, 13, 14, 15, 16)
# print(s5)
# 12    ::000013::14    :: 15   ::+16   ::

s6 = '%06d::%0*d::%.3f::%.*f' % (12, 3, 13, 14, 5, 15)
print(s6)
# 000012::013::14.000::15.00000
