"""
自定义进程类
"""
from multiprocessing import Process
import requests
import re, time
# Crypto模块安装很坑,没装上的建议百度
from Crypto.Cipher import AES


def func_time(func):
    def inner(*args,**kw):
        start_time = time.time()
        func(*args,**kw)
        end_time = time.time()
        print('下载时间为：',end_time-start_time,'s')
    return inner


class MyProcess(Process):
    def __init__(self, str1, str2):
        """

        :param str1: 01a,01p
        :param str2: 0606a,0606p
        """
        super().__init__()
        # TODO 需要自己添加
        self.name = f'python_testtheory2_day{str1}.mp4'
        # m3u8文件的url,需要去抓包看地址,有规律
        # TODO 需要自己添加
        # self.m3u8_url = f'http://c.it211.com.cn/D_VIP_TSD_N_BASIC_DAY{str2}/D_VIP_TSD_N_BASIC_DAY{str2}.m3u8'
        # self.m3u8_url = f'http://c.it211.com.cn/AID_TEDU_TSD_N_TESTTHEORY02_DAY{str1}/AID_TEDU_TSD_N_TESTTHEORY02_DAY{str1}.m3u8'
        self.m3u8_url = f'http://c.it211.com.cn/AID_TEDU_TSD_N_FUNCTIONPROJECT_DAY{str1}/AID_TEDU_TSD_N_FUNCTIONPROJECT_DAY{str1}.m3u8'
        # self.m3u8_url = f'http://c.it211.com.cn/AID_TEDU_TSD_N_TESTTHEORY03_DAY{str1}/AID_TEDU_TSD_N_TESTTHEORY03_DAY{str1}.m3u8'
        # self.m3u8_url = f'http://c.it211.com.cn/AID_TEDU_TSD_N_PYTHON-WITH-SELENIUM_DAY{str1}/AID_TEDU_TSD_N_PYTHON-WITH-SELENIUM_DAY{str1}.m3u8'
        self.headers = {
            "Origin": "http://tts.tmooc.cn",
            # TODO 需要自己添加
            "Referer": f"http://tts.tmooc.cn/video/showVideo?menuId={str2}&version=AIDTN202004",
            # 建议写本机的User-Agent
            "User-Agent": "Mozilla/5.0 (Windows NT 6.1; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/83.0.4103.97 Safari/537.36"
        }
        self.f = open(self.name, 'wb')

    def get_key_ts(self):
        """通过正值表达式获取m3u8文件内容中key和ts的url"""
        # 获取m3u8内容
        m3u8_content = requests.get(url=self.m3u8_url, headers=self.headers).text
        # print(m3u8_content)
        # key的正则匹配
        k = re.compile(r"http://.*?\.key")
        # ts的正则匹配
        t = re.compile(r"http://.*?\.ts")
        # key的url
        # print(k.findall(m3u8_content))
        key_url = k.findall(m3u8_content)[0]
        # ts的url列表
        ts_urls = t.findall(m3u8_content)
        # 下载key的二进制数据
        key = self.get_key(key_url)
        # 解密,保存ts文件
        self.decrypt_save_ts(key, ts_urls)

    def get_key(self, key_url):
        """功能函数1-下载key的二进制数据"""
        key = requests.get(url=key_url,headers=self.headers).content
        return key

    def decrypt_save_ts(self, key, ts_urls):
        """功能函数2:解密,保存"""
        for ts_url in ts_urls:
            ts_name = ts_url.split("/")[-1]  # ts文件名
            # 解密，new有三个参数，
            # 第一个是秘钥（key）的二进制数据，
            # 第二个使用下面这个就好
            # 第三个IV在m3u8文件里URI后面会给出，如果没有，可以尝试把秘钥（key）赋值给IV
            sprytor = AES.new(key, AES.MODE_CBC, IV=key)

            # 获取ts文件二进制数据
            print("正在下载：" + ts_name)
            ts = requests.get(url=ts_url,headers=self.headers).content
            # 密文长度不为16的倍数，则添加b"0"直到长度为16的倍数
            while len(ts) % 16 != 0:
                ts += b"0"

            # with open(self.name, "ab") as file:
            #     # decrypt方法的参数需要为16的倍数，如果不是，需要在后面补二进制"0"
            #     file.write(sprytor.decrypt(ts))
            self.f.write(sprytor.decrypt(ts))

    @func_time
    def run(self):
        self.get_key_ts()
        self.f.close()
        print(self.name, "下载完成")


if __name__ == '__main__':

    list11 = [
        ('01_01', '715409'),
        ('01_02', '715409'),
        ('01_03', '715409'),
        ('01_04', '715409'),
        ('01_05', '715409'),
        ('01_06', '715409'),
        ('01_07', '715409'),
        ('01_08', '715409'),
        ('01_09', '715409'),
        ('01_10', '715409'),
        ('01_11', '715409'),
        ('01_12', '715409'),

        ('02_01', '715408'),
        ('02_02', '715408'),
        ('02_03', '715408'),
        ('02_04', '715408'),
        ('02_05', '715408'),
        ('02_06', '715408'),
        ('02_07', '715408'),
        ('02_08', '715408'),
        ('02_09', '715408'),
        ('02_10', '715408'),
        ('02_11', '715408'),

        ('03_01', '715407'),
        ('03_02', '715407'),
        ('03_03', '715407'),
        ('03_04', '715407'),
        ('03_05', '715407'),
        ('03_06', '715407'),
        ('03_07', '715407'),
        ('03_08', '715407'),
        ('03_09', '715407'),
        ('03_10', '715407'),
        ('03_11', '715407'),

        ('04_01', '715406'),
        ('04_02', '715406'),
        ('04_03', '715406'),
        ('04_04', '715406'),
        ('04_05', '715406'),
        ('04_06', '715406'),
        ('04_07', '715406'),
        ('04_08', '715406'),
        ('04_09', '715406'),
        ('04_10', '715406'),
        ('04_11', '715406'),

        ('05_01', '715405'),
        ('05_02', '715405'),
        ('05_03', '715405'),
        ('05_04', '715405'),
        ('05_05', '715405'),
        ('05_06', '715405'),
        ('05_07', '715405'),
        ('05_08', '715405'),
        ('05_09', '715405'),
        ('05_10', '715405'),
        ('05_11', '715405'),
        ('05_12', '715405'),

    ]

    list1 = [
        ('01_01', '715404'),
        ('01_02', '715404'),
        ('01_03', '715404'),
        ('01_04', '715404'),
        ('01_05', '715404'),
        ('01_06', '715404'),
        ('01_07', '715404'),
        ('01_08', '715404'),
        ('01_09', '715404'),
        ('01_10', '715404'),
        ('01_11', '715404'),


        ('02_01', '715403'),
        ('02_02', '715403'),
        ('02_03', '715403'),
        ('02_04', '715403'),
        ('02_05', '715403'),
        ('02_06', '715403'),
        ('02_07', '715403'),
        ('02_08', '715403'),
        ('02_09', '715403'),
        ('02_10', '715403'),
        ('02_11', '715403'),
        ('02_12', '715403'),
        ('02_13', '715403'),

        ('03_01', '715402'),
        ('03_02', '715402'),
        ('03_03', '715402'),
        ('03_04', '715402'),
        ('03_05', '715402'),
        ('03_06', '715402'),
        ('03_07', '715402'),
        ('03_08', '715402'),
        ('03_09', '715402'),
        ('03_10', '715402'),
        ('03_11', '715402'),

        ('04_01', '715401'),
        ('04_02', '715401'),
        ('04_03', '715401'),
        ('04_04', '715401'),
        ('04_05', '715401'),
        ('04_06', '715401'),
        ('04_07', '715401'),
        ('04_08', '715401'),
        ('04_09', '715401'),
        ('04_10', '715401'),

        ('05_01', '715400'),
        ('05_02', '715400'),
        ('05_03', '715400'),
        ('05_04', '715400'),
        ('05_05', '715400'),
        ('05_06', '715400'),
        ('05_07', '715400'),
        ('05_08', '715400'),
        ('05_09', '715400'),
        ('05_10', '715400'),
        ('05_11', '715400'),

    ]

    list12 = [
        ('01_01', '715399'),
        ('01_02', '715399'),

        ('02_01', '715408'),
        ('02_02', '715408'),
        ('02_03', '715408'),
        ('02_04', '715408'),
        ('02_05', '715408'),
        ('02_06', '715408'),
        ('02_07', '715408'),
        ('02_08', '715408'),
        ('02_09', '715408'),
        ('02_10', '715408'),
        ('02_11', '715408'),

        ('03_01', '715407'),
        ('03_02', '715407'),
        ('03_03', '715407'),
        ('03_04', '715407'),
        ('03_05', '715407'),
        ('03_06', '715407'),
        ('03_07', '715407'),
        ('03_08', '715407'),
        ('03_09', '715407'),
        ('03_10', '715407'),
        ('03_11', '715407'),

        ('04_01', '715406'),
        ('04_02', '715406'),
        ('04_03', '715406'),
        ('04_04', '715406'),
        ('04_05', '715406'),
        ('04_06', '715406'),
        ('04_07', '715406'),
        ('04_08', '715406'),
        ('04_09', '715406'),
        ('04_10', '715406'),
        ('04_11', '715406'),

        ('05_01', '715405'),
        ('05_02', '715405'),
        ('05_03', '715405'),
        ('05_04', '715405'),
        ('05_05', '715405'),
        ('05_06', '715405'),
        ('05_07', '715405'),
        ('05_08', '715405'),
        ('05_09', '715405'),
        ('05_10', '715405'),
        ('05_11', '715405'),
        ('05_12', '715405'),

    ]

    list2 = []
    for item in list1:
        p = MyProcess(item[0], item[1])
        p.start()
        list2.append(p)

    for i in list2:
        i.join()


